<details><summary>Digger run report at 2024-02-27 15:26:50 (UTC)</summary>
    <details><summary>Plan for <b>diggerhq/demo-terragrunt-parallel#app-a</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "demo-terragrunt-parallel-app-a"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

  ```
</details>

<details><summary>Terraform plan validation check (app-a)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>